Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботыОснПродавцом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияАнализовПоМедКнижке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промоутер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорпоративнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорпоративныеБанковскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнештатныйСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьВнештатника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитСкладу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяИнициаторомЗаявокНаРасходДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентБонусаПомощникаУправляющего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УинВЗуп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Информация для помошника управляющего (Откуда сотрудник будет ехать на подработку)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомощникТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КабинетРассылкиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РоумингТолькоСвоиЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияПсихологОсв</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникТилси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуперпользовательТехбота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободноЗанятый</Name>
					<Comment>Признак назначается физ. лицам, с неполной занятостью (студентам пр.) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВахтыВГрафике</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВахтГрафикиРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПройденныеТренинги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тренинг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрохождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТренингПройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ФормаРедактированиеТренингов/Ext/Form/Module.bsl
//+++ gusd

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	Открытьформу("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		НайденныеСтроки = СоставПодбора.НайтиСтроки(Новый Структура("ФизЛицо", ВыбранноеЗначение));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = СоставПодбора.Добавить();
			НоваяСтрока.ФизЛицо = ВыбранноеЗначение;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Если СоставПодбора.Количество() Тогда
		
		Ответ = Вопрос("Все подобранные физ. лица будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 
		
		СоставПодбора.Очистить();
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПодбораПриАктивизацииСтроки(Элемент)
	
	ПерезаполнитьДанныеТренингов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДанныеТренингов()
	
	ТренингиФизЛица.Очистить();
	
	ТекДанные = Элементы.СоставПодбора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПерезаполнитьДанныеТренинговНаСервере(ТекДанные.ФизЛицо);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДанныеТренинговНаСервере(ФизЛицо)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ФизЛицо);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛицаПройденныеТренинги.Тренинг,
	|	ФизическиеЛицаПройденныеТренинги.ДатаПрохождения,
	|	ФизическиеЛицаПройденныеТренинги.ТренингПройден
	|ИЗ
	|	Справочник.ФизическиеЛица.ПройденныеТренинги КАК ФизическиеЛицаПройденныеТренинги
	|ГДЕ
	|	ФизическиеЛицаПройденныеТренинги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическиеЛицаПройденныеТренинги.НомерСтроки";
				   
	ТренингиФизЛица.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТренингиФизЛицаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.СоставПодбора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаписатьДанныеПоФизЛицуНаСервере(ТекДанные.ФизЛицо);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТренингиФизЛицаПослеУдаления(Элемент)
	
	ТекДанные = Элементы.СоставПодбора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеПоФизЛицуНаСервере(ТекДанные.ФизЛицо);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеПоФизЛицуНаСервере(ФизЛицо)
	
	СпрОб = ФизЛицо.ПолучитьОбъект();
	СпрОб.ПройденныеТренинги.Загрузить(ТренингиФизЛица.Выгрузить());
	СпрОб.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПодбораФизЛицоПриИзменении(Элемент)
	
	ПерезаполнитьДанныеТренингов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТренингПройден(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	ЗафиксироватьПройденныйТренингВсемФизЛицам();
	
	ПерезаполнитьДанныеТренингов();
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьПройденныйТренингВсемФизЛицам()
	
	Для каждого Стр Из СоставПодбора Цикл
		
		СпрОб = Стр.ФизЛицо.ПолучитьОбъект();
		
		НайденнаяСтрока = СпрОб.ПройденныеТренинги.Найти(Тренинг, "Тренинг");
		Если НайденнаяСтрока = Неопределено Тогда
			
			НоваяСтрока = СпрОб.ПройденныеТренинги.Добавить();
			
			НоваяСтрока.Тренинг 		= Тренинг;
			НоваяСтрока.ДатаПрохождения = ДатаТренинга;
			НоваяСтрока.ТренингПройден 	= Истина;
			
		Иначе
			
			// Запись уже есть
			Если НайденнаяСтрока.ДатаПрохождения <> ДатаТренинга Тогда
				
				НоваяСтрока = СпрОб.ПройденныеТренинги.Добавить();
				
				НоваяСтрока.Тренинг 		= Тренинг;
				НоваяСтрока.ДатаПрохождения = ДатаТренинга;
				НоваяСтрока.ТренингПройден 	= Истина;	
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		СпрОб.Записать();	
		
	КонецЦикла; 
	
КонецПроцедуры

//--- gusd
